#+TITLE: Salas 2020 Dot1L Transcript Data
#+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup
#+PROPERTY: header-args :exports both :eval never-export
#+OPTIONS: H:4 num:nil toc:5
#+EXCLUDE_TAGS: noexport
#+AUTHOR: Mehmet Tekman

We extract the Dot1L data produced by the Galaxy matrices (with histories name /Adrian Salas exon-level Datasets Results/)

Here we download and fix the transcript names to give proper names, as well as retaining their barcodes.

We will then merge all these matrices/libraries into the same file with columns of:

 1. Library
 2. CellBarcode
 3. Dot1L Isoform1 Total
 4. Dot1L Isoform2 Total
 5. Dot1L IsoformN Total
 6. Dot1L Isoform1 ExonX ...
 7. Dot1L Isoform1 ExonY ...
 8. Dot1L Isoform1 ExonZ ...
 9. Dot1L Isoform2 ExonB ...
 10. Dot1L IsoformN ExonA ...
 11. etc.

* Map the GTF file

    Let's map out the GTf file, so that we can resolve =ENS= exon names to actual =Gene_Exon= names.

    #+begin_src python :session yes
      mapped = {}
      with open("matrices/gencode.vM23.annotation.gtf.gz", 'r') as gtf:  ## it's actually plaintext
          for line in gtf:
              if line[0] != '#':
                  j,j,j,j,j,j,j,j,stuff = line.split('\t')
                  iterable = list(p.strip().split(' ') for p in stuff.split(';'))
                  gene_id = None; gene_name = None; exon_id = None; exon_number = None; transcript_name = None
                  for a in iterable:
                      if len(a)!=2:
                          continue
                      x = a[0]
                      y = a[1]
                      if x=="exon_id":exon_id = y.split('"')[1]
                      elif x=="exon_number":exon_number = int(y)
                      elif x=="gene_id":gene_id = y.split('"')[1]
                      elif x=="gene_name":gene_name = y.split('"')[1]
                      elif x=="transcript_name":transcript_name = y.split('"')[1]
                      #else:print("No annotation found!", iterable)
                  if exon_id:
                      if exon_id not in mapped:
                          mapped[exon_id] = [gene_name, {transcript_name : [exon_number]}]
                      else:
                          if gene_name != mapped[exon_id][0]:
                              print("Different Gene:", exon_id, mapped[exon_id][0], gene_name)
                          else:
                              trans_names = mapped[exon_id][1]
                              if transcript_name not in trans_names:
                                  mapped[exon_id][1][transcript_name] = [exon_number]
                              else:
                                  if exon_number not in mapped[exon_id][1][transcript_name]:
                                      mapped[exon_id][1][transcript_name].append(exon_number)







    #+end_src

    #+RESULTS:

    Quick printout of the Dot1L transcripts:
    
    #+begin_src python :session yes :results output verbatim
      for x in mapped:
          if mapped[x][0].startswith("Dot1l"):
              print(mapped[x])
    #+end_src

    #+RESULTS:
    #+begin_example
    ['Dot1l', {'Dot1l-201': [1]}]
    ['Dot1l', {'Dot1l-201': [2], 'Dot1l-202': [2]}]
    ['Dot1l', {'Dot1l-201': [3]}]
    ['Dot1l', {'Dot1l-201': [4]}]
    ['Dot1l', {'Dot1l-201': [5]}]
    ['Dot1l', {'Dot1l-201': [6]}]
    ['Dot1l', {'Dot1l-201': [7]}]
    ['Dot1l', {'Dot1l-201': [8], 'Dot1l-206': [1]}]
    ['Dot1l', {'Dot1l-201': [9], 'Dot1l-206': [2]}]
    ['Dot1l', {'Dot1l-201': [10], 'Dot1l-206': [3]}]
    ['Dot1l', {'Dot1l-201': [11], 'Dot1l-206': [4]}]
    ['Dot1l', {'Dot1l-201': [12], 'Dot1l-206': [5]}]
    ['Dot1l', {'Dot1l-201': [13], 'Dot1l-206': [6]}]
    ['Dot1l', {'Dot1l-201': [14], 'Dot1l-206': [7]}]
    ['Dot1l', {'Dot1l-201': [15], 'Dot1l-206': [8]}]
    ['Dot1l', {'Dot1l-201': [16], 'Dot1l-206': [9]}]
    ['Dot1l', {'Dot1l-201': [17], 'Dot1l-206': [10]}]
    ['Dot1l', {'Dot1l-201': [18], 'Dot1l-206': [11]}]
    ['Dot1l', {'Dot1l-201': [19], 'Dot1l-206': [12]}]
    ['Dot1l', {'Dot1l-201': [20], 'Dot1l-206': [13]}]
    ['Dot1l', {'Dot1l-201': [21], 'Dot1l-206': [14]}]
    ['Dot1l', {'Dot1l-201': [22], 'Dot1l-206': [15]}]
    ['Dot1l', {'Dot1l-201': [23], 'Dot1l-206': [16]}]
    ['Dot1l', {'Dot1l-201': [24], 'Dot1l-206': [17]}]
    ['Dot1l', {'Dot1l-201': [25], 'Dot1l-206': [18], 'Dot1l-205': [2]}]
    ['Dot1l', {'Dot1l-201': [26], 'Dot1l-206': [19], 'Dot1l-205': [3]}]
    ['Dot1l', {'Dot1l-201': [27], 'Dot1l-205': [4]}]
    ['Dot1l', {'Dot1l-201': [28]}]
    ['Dot1l', {'Dot1l-202': [1]}]
    ['Dot1l', {'Dot1l-202': [3]}]
    ['Dot1l', {'Dot1l-202': [4]}]
    ['Dot1l', {'Dot1l-202': [5]}]
    ['Dot1l', {'Dot1l-202': [6]}]
    ['Dot1l', {'Dot1l-202': [7]}]
    ['Dot1l', {'Dot1l-202': [8]}]
    ['Dot1l', {'Dot1l-202': [9]}]
    ['Dot1l', {'Dot1l-202': [10]}]
    ['Dot1l', {'Dot1l-202': [11]}]
    ['Dot1l', {'Dot1l-202': [12]}]
    ['Dot1l', {'Dot1l-202': [13]}]
    ['Dot1l', {'Dot1l-202': [14]}]
    ['Dot1l', {'Dot1l-202': [15]}]
    ['Dot1l', {'Dot1l-202': [16], 'Dot1l-207': [2]}]
    ['Dot1l', {'Dot1l-202': [17]}]
    ['Dot1l', {'Dot1l-202': [18]}]
    ['Dot1l', {'Dot1l-202': [19]}]
    ['Dot1l', {'Dot1l-202': [20]}]
    ['Dot1l', {'Dot1l-202': [21]}]
    ['Dot1l', {'Dot1l-202': [22]}]
    ['Dot1l', {'Dot1l-202': [23]}]
    ['Dot1l', {'Dot1l-202': [24]}]
    ['Dot1l', {'Dot1l-204': [1]}]
    ['Dot1l', {'Dot1l-204': [2]}]
    ['Dot1l', {'Dot1l-204': [3]}]
    ['Dot1l', {'Dot1l-206': [20]}]
    ['Dot1l', {'Dot1l-206': [21]}]
    ['Dot1l', {'Dot1l-207': [1]}]
    ['Dot1l', {'Dot1l-207': [3]}]
    ['Dot1l', {'Dot1l-205': [1]}]
    ['Dot1l', {'Dot1l-205': [5]}]
    ['Dot1l', {'Dot1l-205': [6]}]
    ['Dot1l', {'Dot1l-205': [7]}]
    ['Dot1l', {'Dot1l-203': [1]}]
    ['Dot1l', {'Dot1l-203': [2]}]
    #+end_example

* Aggregate all tables

    Now let's cat them all together into one big table

    #+begin_src bash :var indir="fixed_dot1l_longformat" outfile="largemat/all.dot1l.longformat.tsv"
      mkdir -p $(dirname $outfile)
      first=Y
      for file in $indir/*.dot1l.longformat.tsv; do
          if [ "$first" == "Y" ]; then
             head -1 $file > $outfile ## extract common header
             first=N
          fi
          tail -n +2 $file >> $outfile
      done
      wc -l $outfile
    #+end_src

    #+RESULTS:
    : 1296 largemat/all.dot1l.longformat.tsv

